import styled from "styled-components";

const PostBodyBlock = styled.div`
  width: 97%;
  height: auto;
  margin: 10px auto;

  .map {
    height: 200px;
    border: 1px solid #bcbcbc;
    margin-bottom: 10px;
  }

  .content {
    border: 1px solid #bcbcbc;
    font-size: 15px;
    padding: 25px;
  }
`;

const PostBody = () => {
  return (
    <PostBodyBlock>
      <div className="map"></div>
      <div className="content">
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
        안녕하세요 본문 내용 컨텐츠 입니다. 그런데 이걸 왜 제가 만들고 있어야
        할까요? 제가 왜 공모전을 한다고 해서 이 짓을 하고 있어야 하나요? 맨 땅에
        헤딩하고 있는데 도와줄 사람은 아무도 없는 걸까요? 살려주세요 제발요..
      </div>
    </PostBodyBlock>
  );
};

export default PostBody;
